name: "cv_pipeline"
platform: "ensemble"
input [
  {
    name: "INPUT__0"  #anh xa xuong value o dau vao dau tien trong "step"
    data_type: TYPE_FP32
    dims: [ 3, 608, 608 ]
  }
]
output [
  {
    name: "OUTPUT__1 #anh xa xuong value o dau ra cuoi cung trong "step"
    data_type: TYPE_FP32
    dims: [ 3,608,608 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "pre_faster"
      model_version: -1
      input_map {
        key: "INPUT_PRE_FASTER"
        value: "INPUT__0"
      },
      output_map {
        key: "OUTPUT_PRE_FASTER"  #trung key, k can trung val
        value: "OUTPUT__0"
      }
    },
    {
      model_name: "faster_rnn"
      model_version: -1
      input_map {
        key: "input"
        value: "OUTPUT__0"
      },
      output_map {
        key: "dets"
        value: "OUTPUT__1"
      }
    }

  ]
}


"""phai chinh ca cac ten tuong ung trong ham initialize va execute trong cac file logic"""
