name: "faster_rnn"
platform: "onnxruntime_onnx"
max_batch_size : 32
input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 3, 608, 608 ]
  }
]
output [
  {
    name: "dets"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
  },
  {
    name: "labels"
    data_type: TYPE_INT64
    dims: [ -1 ]
  }
  
]
instance_group [
  {
    count:1
    kind: KIND_GPU
    gpus: [0]
  }

]

