name: "post_faster"
backend: "python"
max_batch_size: 8
input[
 {
    name: "INPUT_POST_FASTER"
    data_type: TYPE_FP32
    dims: [-1, -1]
 },
 {
    name: "INPUT_POST_FASTER_IMG"
    data_type: TYPE_FP32
    dims: [3,608,608]
 }
]


output [
  {
    name: "OUTPUT_POST_FASTER"
    data_type: TYPE_FP32
    dims: [3,224,224]
  }
]


instance_group [{ kind: KIND_GPU }]
